app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    # Fetch all posts
    @items = Item.all